# Homework 3 (Advanced MySQL and Jupyter)

## Overview

In this homework, you will practice more SQL queries using the same sample database that you used in Homework 2. In addition, you will gain experience using MySQL in Jupyter/Python by writing your commands inside this Jupyter notebook.

## Setup 

A Jupyter notebook server is preinstalled in the `mysql` container. You can start the Jupyter server by executing the following command inside the container

```
$ jupyter notebook
[W 03:24:58.828 NotebookApp] All authentication is disabled.  Anyone who can connect to this server will be able to run code.
[I 03:24:58.885 NotebookApp] JupyterLab extension loaded from /usr/local/lib/python3.6/dist-packages/jupyterlab
[I 03:24:58.885 NotebookApp] JupyterLab application directory is /usr/local/share/jupyter/lab
[I 03:24:58.888 NotebookApp] Serving notebooks from local directory: /home/msa402
[I 03:24:58.889 NotebookApp] The Jupyter Notebook is running at:
[I 03:24:58.889 NotebookApp] http://(08058294852c or 127.0.0.1):8888/
[I 03:24:58.889 NotebookApp] Use Control-C to stop this server and shut down all kernels (twice to skip confirmation).
```

Once started, you can access the Jupyter server at <http://localhost:8888/> on your host machine. Please open your browser and access the URL and ensure that the server is running.

**Note**: In case you are using Docker Toolbox on Windows and your browser does not display a page at <http://localhost:8888>, run `docker-machine ls` in your docker terminal to determine where your container is running. It can be, for example, 192.168.99.100. Then, go to <http://192.168.99.100:8888> instead of <http://localhost:8888>.

## Download the notebook

Now download this notebook to your computer, by right clicking on the "download icon" at the top of this notebook and selecting the "Save Link As..." context menu. 

![Download Link](http://oak.cs.ucla.edu/classes/msa402/homeworks/notebook-download-link.png)

Move the downloaded notebook to the shared directory in your host computer, so that the notebook is accessible from within the container, and in turn, the Jupyter notebook server. Open the downloaded notebook by navigating to your shared directory within the Jupyter server accessed through your browser. 

![Shared Folder](http://oak.cs.ucla.edu/classes/msa402/homeworks/notebook-shared.png)


The rest of this homework should be performed by editing the notebook that you have locally downloaded. Please fill the appropriate cells in the notebook with your code that performs the tasks given below.

## Setup MySQL connection

We often need to pull data stored in a RDBMS and manipulate and display it using our own custom program. One goal of this homework is to learn how to do it with the Python programming language.

First, go over the [Python MySQL Connector Tutorial](https://www.w3schools.com/python/python_mysql_getstarted.asp) to learn how to connect to a MySQL database and run SQL queries to it. In following the tutorial, you can skip "Install MySQL Driver" and "Test MySQL Connector" sections and start at the "Create Connection" section because MySQL server and its connector has already been properly setup.

Note that when you create a database connector using `connect()`, you need to use `database='msa402'` and `user='msa402'` as its parameters like the following:

```python
mydb = mysql.connector.connect(
    database='msa402',
    user='msa402'
)
```

since these are the names of our database and the user.

Once the database connector is set up and a cursor is obtained by calling `cursor()`, any SQL command can be executed via `execute()` as it is explained in the tutorial.

**Task1**: Now that you have learned how, your task here is to import mysql-connector for python (`mysql.connector` module), connect to the `msa402` database as the user `msa402`, and obtain the cursor. Please fill in the cell below with a sequence of python commands that perform this task:

In [27]:
import mysql.connector

mydb = mysql.connector.connect(
    database='msa402',
    user='msa402'
    #connection_timeout=3600
)

print(mydb)

mycursor=mydb.cursor()

<mysql.connector.connection_cext.CMySQLConnection object at 0x7f39fb805630>

## Create tables

**Task2**: Now that you have established MySQL connection and obtained the cursor, it is time to use it to execute SQL comands to create tables. In the cell below, execute a series of `create table` command to create tables according to the following schema:
    
Classroom(<u>building</u>, <u>room\_number</u>, capacity)  
Department(<u>dept</u>, building, budget)  
Class(<u>class\_id</u>, title, dept, credits)  
Instructor(<u>id</u>, name, dept, salary)  
Section(<u>class\_id</u>, <u>sec\_id</u>, <u>semester</u>, <u>year</u>, building, om\_number)  
Teaches(<u>id</u>, <u>class\_id</u>, <u>sec\_id</u>, <u>semester</u>, <u>year</u>)  
Student(<u>id</u>, name, dept, tot\_cred)  
Takes(<u>id</u>, <u>class\_id</u>, <u>sec\_id</u>, <u>semester</u>, <u>year</u>, grade)  
Advisor(<u>s\_id</u>, i\_id)  
Prereq(<u>class\_id</u>, <u>prereq\_id</u>)  

Please note that we already provided [SQL script file](http://oak.cs.ucla.edu/classes/msa402/homeworks/hw2-load.sql) that included the SQL commands to create tables according to the above schema. It is OK to copy create table commands from the file.

In [2]:
mycursor.execute("""
drop table if exists Advisor
""")
mycursor.execute("""
drop table if exists Takes;
""")

mycursor.execute("""
drop table if exists Student;
""")
mycursor.execute("""
drop table if exists Teaches;
""")
mycursor.execute("""
drop table if exists Section;
""")
mycursor.execute("""
drop table if exists Instructor;
""")
mycursor.execute("""
drop table if exists Class;
""")
mycursor.execute("""
drop table if exists Department;
""")
mycursor.execute("""
drop table if exists Classroom;
""")
mycursor.execute("""
drop table if exists Prereq;
""")

In [3]:
mycursor.execute("""
create table Classroom (building varchar(15), room_number integer, capacity integer, primary key (building, room_number) );
""")
mycursor.execute("""
create table Department (dept varchar(20), building varchar(15), budget decimal(12,2), primary key (dept) );
""")
mycursor.execute("""
create table Class (class_id varchar(8), title varchar(50), dept varchar(20), credits integer, primary key (class_id) );
""")
mycursor.execute("""
create table Instructor (id integer, name varchar(20) not null, dept varchar(20), salary decimal(8,2), primary key (id) );
""")
mycursor.execute("""
create table Section (class_id varchar(8), sec_id integer, semester varchar(6), year integer, building varchar(15), room_number integer, primary key (class_id, sec_id, semester, year) );
""")
mycursor.execute("""
create table Teaches (id integer, class_id varchar(8), sec_id integer, semester varchar(6), year integer, primary key (id, class_id, sec_id, semester, year) );
""")
mycursor.execute("""
create table Student (id integer, name varchar(20) not null, dept varchar(20), tot_cred integer, primary key (id) );
""")
mycursor.execute("""
create table Takes (id integer, class_id varchar(8), sec_id integer, semester varchar(6), year integer, grade varchar(2), primary key (id, class_id, sec_id, semester, year) );
""")
mycursor.execute("""
create table Advisor (s_id integer, i_id integer, primary key (s_id) );
""")
mycursor.execute("""
create table Prereq (class_id varchar(8), prereq_id varchar(8), primary key(class_id, prereq_id) );
""")

## Load tuples

**Task3**: Now populate the created tables with the same set of tuples that [our script](http://oak.cs.ucla.edu/classes/msa402/homeworks/hw2-load.sql) inserts. Again it is OK to copy insert commands in the script.

In [4]:
mycursor.execute("""
insert into Classroom values ('Packard', '101', '500'), ('Painter', '514', '10'), ('Taylor', '3128', '70'), ('Watson', '100', '30'), ('Watson', '120', '50');
""")
mycursor.execute("""
insert into Department values ('Biology', 'Watson', '90000'), ('Comp. Sci.', 'Taylor', '100000'), ('Elec. Eng.', 'Taylor', '85000'), ('Finance', 'Painter', '120000'), ('History', 'Painter', '50000'), ('Music', 'Packard', '80000'), ('Physics', 'Watson', '70000');
""")
mycursor.execute("""
insert into Class values ('CS-101', 'Intro. to Computer Science', 'Comp. Sci.', '4'), ('BIO-101', 'Intro. to Biology', 'Biology', '4'), ('BIO-301', 'Genetics', 'Biology', '4'), ('BIO-399', 'Computational Biology', 'Biology', '3'), ('CS-190', 'Game Design', 'Comp. Sci.', '4'), ('CS-315', 'Robotics', 'Comp. Sci.', '3'), ('CS-319', 'Image Processing', 'Comp. Sci.', '3'), ('CS-347', 'Database System Concepts', 'Comp. Sci.', '3'), ('EE-181', 'Intro. to Digital Systems', 'Elec. Eng.', '3'), ('FIN-201', 'Investment Banking', 'Finance', '3'), ('HIS-351', 'World History', 'History', '3'), ('MU-199', 'Music Video Production', 'Music', '3'), ('PHY-101', 'Physical Principles', 'Physics', '4');
""")
mycursor.execute("""
insert into Instructor values ('10101', 'Srinivasan', 'Comp. Sci.', '65000'), ('12121', 'Wu', 'Finance', '90000'), ('15151', 'Mozart', 'Music', '40000'), ('22222', 'Einstein', 'Physics', '95000'), ('32343', 'El Said', 'History', '60000'), ('33456', 'Gold', 'Physics', '87000'), ('45565', 'Katz', 'Comp. Sci.', '75000'), ('58583', 'Califieri', 'History', '62000'), ('87543', 'Singh', 'Finance', '80000'), ('76766', 'Crick', 'Biology', '72000'), ('83821', 'Brandt', 'Comp. Sci.', '92000'), ('98345', 'Kim', 'Elec. Eng.', '80000');
""")
mycursor.execute("""
insert into Section values ('BIO-101', '1', 'Summer', '2009', 'Painter', '514'), ('BIO-301', '1', 'Summer', '2010', 'Painter', '514'), ('CS-101', '1', 'Fall', '2009', 'Packard', '101'), ('CS-101', '1', 'Spring', '2010', 'Packard', '101'), ('CS-190', '1', 'Spring', '2009', 'Taylor', '3128'), ('CS-190', '2', 'Spring', '2009', 'Taylor', '3128'), ('CS-315', '1', 'Spring', '2010', 'Watson', '120'), ('CS-319', '1', 'Spring', '2010', 'Watson', '100'), ('CS-319', '2', 'Spring', '2010', 'Taylor', '3128'), ('CS-347', '1', 'Fall', '2009', 'Taylor', '3128'), ('EE-181', '1', 'Spring', '2009', 'Taylor', '3128'), ('FIN-201', '1', 'Spring', '2010', 'Packard', '101'), ('HIS-351', '1', 'Spring', '2010', 'Painter', '514'), ('MU-199', '1', 'Spring', '2010', 'Packard', '101'), ('PHY-101', '1', 'Fall', '2009', 'Watson', '100');
""")
mycursor.execute("""
insert into Teaches values ('12121', 'FIN-201', '1', 'Spring', '2010'), ('10101', 'CS-315', '1', 'Spring', '2010'), ('10101', 'CS-101', '1', 'Fall', '2009'), ('10101', 'CS-347', '1', 'Fall', '2009'), ('15151', 'MU-199', '1', 'Spring', '2010'), ('22222', 'PHY-101', '1', 'Fall', '2009'), ('32343', 'HIS-351', '1', 'Spring', '2010'), ('45565', 'CS-101', '1', 'Spring', '2010'), ('45565', 'CS-319', '1', 'Spring', '2010'), ('76766', 'BIO-101', '1', 'Summer', '2009'), ('76766', 'BIO-301', '1', 'Summer', '2010'), ('83821', 'CS-190', '1', 'Spring', '2009'), ('83821', 'CS-190', '2', 'Spring', '2009'), ('83821', 'CS-319', '2', 'Spring', '2010'), ('98345', 'EE-181', '1', 'Spring', '2009');
""")
mycursor.execute("""
insert into Student values ('54321', 'Williams', 'Comp. Sci.', '54'), ('00128', 'Zhang', 'Comp. Sci.', '102'), ('12345', 'Shankar', 'Comp. Sci.', '32'), ('19991', 'Brandt', 'History', '80'), ('23121', 'Chavez', 'Finance', '110'), ('44553', 'Peltier', 'Physics', '56'), ('45678', 'Levy', 'Physics', '46'), ('55739', 'Sanchez', 'Music', '38'), ('70557', 'Snow', 'Physics', '0'), ('76543', 'Brown', 'Comp. Sci.', '58'), ('76653', 'Aoi', 'Elec. Eng.', '60'), ('98765', 'Bourikas', 'Elec. Eng.', '98'), ('98988', 'Tanaka', 'Biology', '120');
""")
mycursor.execute("""
insert into Takes values ('23121', 'FIN-201', '1', 'Spring', '2010', 'C+'), ('00128', 'CS-101', '1', 'Fall', '2009', 'A'), ('00128', 'CS-347', '1', 'Fall', '2009', 'A-'), ('12345', 'CS-101', '1', 'Fall', '2009', 'C'), ('12345', 'CS-190', '2', 'Spring', '2009', 'A'), ('12345', 'CS-315', '1', 'Spring', '2010', 'A'), ('12345', 'CS-347', '1', 'Fall', '2009', 'A'), ('19991', 'HIS-351', '1', 'Spring', '2010', 'B'), ('44553', 'PHY-101', '1', 'Fall', '2009', 'B-'), ('45678', 'CS-101', '1', 'Fall', '2009', 'F'), ('45678', 'CS-101', '1', 'Spring', '2010', 'B+'), ('45678', 'CS-319', '1', 'Spring', '2010', 'B'), ('54321', 'CS-101', '1', 'Fall', '2009', 'A-'), ('54321', 'CS-190', '2', 'Spring', '2009', 'B+'), ('55739', 'MU-199', '1', 'Spring', '2010', 'A-'), ('76543', 'CS-101', '1', 'Fall', '2009', 'A'), ('76543', 'CS-319', '2', 'Spring', '2010', 'A'), ('76653', 'EE-181', '1', 'Spring', '2009', 'C'), ('98765', 'CS-101', '1', 'Fall', '2009', 'C-'), ('98765', 'CS-315', '1', 'Spring', '2010', 'B'), ('98988', 'BIO-101', '1', 'Summer', '2009', 'A'), ('98988', 'BIO-301', '1', 'Summer', '2010', null);
""")
mycursor.execute("""
insert into Advisor values ('00128', '45565'), ('12345', '10101'), ('23121', '87543'), ('44553', '22222'), ('45678', '22222'), ('76543', '45565'), ('76653', '98345'), ('98765', '98345'), ('98988', '76766');
""")
mycursor.execute("""
insert into Prereq values ('BIO-301', 'BIO-101'), ('BIO-399', 'BIO-101'), ('CS-190', 'CS-101'), ('CS-315', 'CS-101'), ('CS-319', 'CS-101'), ('CS-347', 'CS-101'), ('EE-181', 'PHY-101');
""")
mydb.commit()

## Advanced SQL queries

Now that you have created tables and populated them with tuples, your next job is to write SQL queries given their English descriptions. In each of the cells below, ***write the python code that executes the SQL queries and print out the results***

**Query1**: Find the average of the total credits enrolled by students.

In [5]:
# SQL query execution and print command here
mycursor.execute("SELECT AVG(tot_cred) FROM Student")

myresult = mycursor.fetchall()
for x in myresult:
  print(x)

(Decimal('65.6923'),)

**Query2**: For each department, find the average credit of the department's classes.

In [6]:
# SQL query execution and print command here
mycursor.execute("""SELECT AVG(credits),Department.dept
FROM Department,Class
Where Department.dept=Class.dept
GROUP BY dept;""")

myresult = mycursor.fetchall()
for x in myresult:
  print(x)

(Decimal('3.6667'), 'Biology')
(Decimal('3.4000'), 'Comp. Sci.')
(Decimal('3.0000'), 'Elec. Eng.')
(Decimal('3.0000'), 'Finance')
(Decimal('3.0000'), 'History')
(Decimal('3.0000'), 'Music')
(Decimal('4.0000'), 'Physics')

**Query3**: Find the departments that offer at least two classes.

In [7]:
# SQL query execution and print command here
mycursor.execute("""SELECT Department.dept
FROM Department,Class
Where Department.dept=Class.dept
GROUP BY dept
HAVING COUNT(Class.class_id)>=2;
""")
myresult = mycursor.fetchall()
for x in myresult:
  print(x)

('Biology',)
('Comp. Sci.',)

**Query4**: Find the names of such departments that all of their classes are of credits 4 or above.

In [8]:
# SQL query execution and print command here
mycursor.execute("""SELECT Department.dept
FROM Department,Class
Where Department.dept=Class.dept
GROUP BY dept
HAVING MIN(Class.credits)>=4;
""")
myresult = mycursor.fetchall()
for x in myresult:
  print(x)

('Physics',)

**Query5**: For the student with ID 44553, find all classes taken for by the student and return the total number of credits from such classes. Don't display the tot\_cred value from the student table, you should use SQL aggregation on classes taken by the student.

In [9]:
# SQL query execution and print command here
mycursor.execute("""SELECT SUM(Class.credits) 
FROM Class,Takes
WHERE id=44553
AND Class.class_id=Takes.class_id;
""")
myresult = mycursor.fetchall()
for x in myresult:
  print(x)

(Decimal('4'),)

**Query6**: As above, but display the total credits for each of the students, along with the ID of the student; don't bother about the name of the student. (Don't bother about students who have not registered for any classes, they can be omitted)

In [10]:
# SQL query execution and print command here
mycursor.execute("""SELECT Takes.id, SUM(Class.credits) 
FROM Class,Takes
WHERE Class.class_id=Takes.class_id
GROUP BY id;
""")
myresult = mycursor.fetchall()
for x in myresult:
  print(x)

(128, Decimal('7'))
(12345, Decimal('14'))
(19991, Decimal('3'))
(23121, Decimal('3'))
(44553, Decimal('4'))
(45678, Decimal('11'))
(54321, Decimal('8'))
(55739, Decimal('3'))
(76543, Decimal('7'))
(76653, Decimal('3'))
(98765, Decimal('7'))
(98988, Decimal('8'))

**Query7**: Grades are mapped to a grade point as follows: A:4, B:3, C:2, D:1 and F:0. Plus and minus grades add and subtract 0.3 from the base point, respectively. Create a table, named `LetterToNumber`, to store these mappings, and write a query to find the GPA of each student, using this table. If a student has a null grade for a particular class, ignore the grade for GPA computation. Also do not bother with students who are not registered for any classes, they can be omitted.

In [11]:
# SQL execution and print command here
mycursor.execute("""
drop table if exists LetterToNumber;
""")
mycursor.execute("""
CREATE TABLE LetterToNumber(grade VARCHAR(5),gradepoint decimal(6,2));
""")
mycursor.execute("""
insert into LetterToNumber values ('A+','4.3'),('A','4'),('A-','3.7'),('B+','3.3'),('B','3'),('B-','2.7'),('C+','2.3'),('C','2'),('C-','1.7'),('D+','1.3'),('D','1'),('D-','0.7'),('F','0');
""")
mycursor.execute("""
SELECT Takes.id, (SUM(LetterToNumber.gradepoint*Class.credits)/SUM(Class.credits)) GPA
FROM LetterToNumber,Takes,Class
WHERE LetterToNumber.grade=Takes.grade
AND Class.class_id=Takes.class_id
GROUP BY id;
""")
myresult = mycursor.fetchall()
for x in myresult:
  print(x)

(128, Decimal('3.871429'))
(12345, Decimal('3.428571'))
(19991, Decimal('3.000000'))
(23121, Decimal('2.300000'))
(44553, Decimal('2.700000'))
(45678, Decimal('2.018182'))
(54321, Decimal('3.500000'))
(55739, Decimal('3.700000'))
(76543, Decimal('4.000000'))
(76653, Decimal('2.000000'))
(98765, Decimal('2.257143'))
(98988, Decimal('4.000000'))

**Query8**: Find all rooms that have been assigned to more than one section in the same semester.

In [12]:
# SQL query execution and print command here
mycursor.execute("""
SELECT Section.room_number,Section.building
FROM Section
GROUP BY Section.semester,Section.year, room_number
HAVING COUNT(Section.class_id)>=2;
""")
myresult = mycursor.fetchall()
for x in myresult:
  print(x)

(3128, 'Taylor')
(101, 'Packard')

**Query9**: Find the maximum and minimum enrollment across all sections, considering only sections that had some enrollment, don't worry about those that had no students taking that section.

In [13]:
# SQL query execution and print command here
mycursor.execute("""
SELECT MAX(count),MIN(count)
FROM(
  SELECT COUNT(Takes.id) count
  FROM Takes
  GROUP BY class_id,sec_id,semester,year) AS S;
""")
myresult = mycursor.fetchall()
for x in myresult:
  print(x)

(6, 1)

**Query10**: Find all sections that had the minimum enrollment (along with the enrollment), using a subquery.

In [28]:
# SQL query execution and print command here
mycursor.execute("""

SELECT S.class_id,S.sec_id,S.semester,S.year,S.count
FROM(
   SELECT class_id,sec_id,COUNT(Takes.id) count,semester,year
  FROM Takes
  GROUP BY class_id,sec_id,semester,year) AS S
WHERE(S.count =(
  SELECT MIN(count)
  FROM(
    SELECT COUNT(Takes.id) count
  FROM Takes
  GROUP BY class_id,sec_id) AS S))
""")
myresult = mycursor.fetchall()
for x in myresult:
  print(x)

('BIO-101', 1, 'Summer', 2009, 1)
('BIO-301', 1, 'Summer', 2010, 1)
('CS-101', 1, 'Spring', 2010, 1)
('CS-319', 1, 'Spring', 2010, 1)
('CS-319', 2, 'Spring', 2010, 1)
('EE-181', 1, 'Spring', 2009, 1)
('FIN-201', 1, 'Spring', 2010, 1)
('HIS-351', 1, 'Spring', 2010, 1)
('MU-199', 1, 'Spring', 2010, 1)
('PHY-101', 1, 'Fall', 2009, 1)

**Query11**: Find the students whose total credit from CS classes is larger than the total credit from all non-CS classes. You need to compute the number of credits using the Takes table.

In [15]:
# mycursor.execute("""
# WITH A1 AS (SELECT Takes.id, Class.dept,SUM(Class.credits) credit1
# FROM Class,Takes
# WHERE Class.class_id=Takes.class_id
# AND Class.dept='Comp. Sci.'
# GROUP BY Class.dept,Takes.id),A2 AS (SELECT Takes.id, Class.dept,SUM(Class.credits) credit2
# FROM Class,Takes
# WHERE Class.class_id=Takes.class_id
# AND Class.dept<>'Comp. Sci.'
# GROUP BY Class.dept,Takes.id)

# SELECT DISTINCT A1.id FROM
# A1, A2

# WHERE (A1.credit1>A2.credit2
# AND A1.id=A2.id)
# OR (A1.id NOT IN (SELECT A2.id FROM A2))

# """)
# myresult = mycursor.fetchall()
# for x in myresult:
#   print(x)

In [16]:
mycursor.execute("""
WITH A1 AS (SELECT Takes.id, Class.dept,SUM(Class.credits) credit1
FROM Class,Takes
WHERE Class.class_id=Takes.class_id
AND Class.dept='Comp. Sci.'
GROUP BY Class.dept,Takes.id),A2 AS (SELECT Takes.id, Class.dept,SUM(Class.credits) credit2
FROM Class,Takes
WHERE Class.class_id=Takes.class_id
AND Class.dept<>'Comp. Sci.'
GROUP BY Class.dept,Takes.id)

SELECT DISTINCT A1.id FROM
A1, A2

WHERE (A1.credit1>A2.credit2
AND A1.id=A2.id)
""")
myresult = mycursor.fetchall()
for x in myresult:
    print(x)

**Query12**: Find the students who obtained the least credits from the CS department among all departments from which they took classes. You need to compute the number of credits using the Takes table.

In [17]:
# SQL query execution and print command here
# mycursor.execute("""
# WITH A1 AS (SELECT Takes.id, Class.dept,SUM(Class.credits) credit1
# FROM Class,Takes
# WHERE Class.class_id=Takes.class_id
# AND Class.dept='Comp. Sci.'
# GROUP BY Class.dept,Takes.id),A2 AS (SELECT Takes.id, Class.dept,SUM(Class.credits) credit1
# FROM Class,Takes
# WHERE Class.class_id=Takes.class_id
# GROUP BY Class.dept,Takes.id)

# SELECT A1.id FROM A1,A2 
# WHERE (A1.credit1<=(SELECT (MIN(A2.credit1) OVER (PARTITION BY id)) FROM A2 WHERE A1.id=A2.id))

# UNION
# SELECT A2.id FROM A1,A2 
# WHERE A2.id NOT IN (SELECT A1.id FROM A1)

# """)
# myresult = mycursor.fetchall()
# for x in myresult:
#   print(x)

In [18]:
mycursor.execute("""
WITH A1 AS (SELECT Takes.id, Class.dept,SUM(Class.credits) credit1
FROM Class,Takes
WHERE Class.class_id=Takes.class_id
AND Class.dept='Comp. Sci.'
GROUP BY Class.dept,Takes.id),A2 AS (SELECT Takes.id, Class.dept,SUM(Class.credits) credit1
FROM Class,Takes
WHERE Class.class_id=Takes.class_id
AND Class.dept<>'Comp. Sci.'
GROUP BY Class.dept,Takes.id)

SELECT A1.id FROM A1,A2 
WHERE (A1.credit1<=(SELECT (MIN(A2.credit1) OVER (PARTITION BY id)) FROM A2 WHERE A1.id=A2.id))

""")
myresult = mycursor.fetchall()
for x in myresult:
  print(x)

**Query13**: Find instructors who have taught all classes with the identifier ending with "101".

In [19]:
# SQL query execution and print command here
# mycursor.execute("""
# (SELECT Teaches.id,Teaches.class_id
# FROM Teaches
# WHERE Teaches.class_id LIKE '%101')
# EXCEPT
# (SELECT S.id,S.class_id FROM(((SELECT Teaches.id,Teaches.class_id
# FROM Teaches)

# EXCEPT

# (SELECT Teaches.id,Teaches.class_id
# FROM Teaches
# WHERE Teaches.class_id LIKE '%101'))AS S))

# """)
# myresult = mycursor.fetchall()
# for x in myresult:
#   print(x)

In [20]:
mycursor.execute("""
SELECT Teaches.id,Instructor.name,Teaches.class_id
FROM Teaches,Instructor
WHERE Teaches.class_id LIKE '%101'
AND Teaches.id=Instructor.id

""")
myresult = mycursor.fetchall()
for x in myresult:
  print(x)

(10101, 'Srinivasan', 'CS-101')
(22222, 'Einstein', 'PHY-101')
(45565, 'Katz', 'CS-101')
(76766, 'Crick', 'BIO-101')

## Database Modification

Your next set of tasks is to write and execute a few database modification commands

**M1**: Insert each instructor as a student, with tot\_cred = 0, in the same department

In [21]:
# Fill in the python code that executes the SQL modification command
mycursor.execute("""
INSERT INTO Student (id, name, dept,tot_cred)
SELECT id, name, dept,'0' FROM Instructor
;
""")
mycursor.execute("""
SELECT * FROM Student
""")
myresult = mycursor.fetchall()
for x in myresult:
  print(x)

(128, 'Zhang', 'Comp. Sci.', 102)
(10101, 'Srinivasan', 'Comp. Sci.', 0)
(12121, 'Wu', 'Finance', 0)
(12345, 'Shankar', 'Comp. Sci.', 32)
(15151, 'Mozart', 'Music', 0)
(19991, 'Brandt', 'History', 80)
(22222, 'Einstein', 'Physics', 0)
(23121, 'Chavez', 'Finance', 110)
(32343, 'El Said', 'History', 0)
(33456, 'Gold', 'Physics', 0)
(44553, 'Peltier', 'Physics', 56)
(45565, 'Katz', 'Comp. Sci.', 0)
(45678, 'Levy', 'Physics', 46)
(54321, 'Williams', 'Comp. Sci.', 54)
(55739, 'Sanchez', 'Music', 38)
(58583, 'Califieri', 'History', 0)
(70557, 'Snow', 'Physics', 0)
(76543, 'Brown', 'Comp. Sci.', 58)
(76653, 'Aoi', 'Elec. Eng.', 60)
(76766, 'Crick', 'Biology', 0)
(83821, 'Brandt', 'Comp. Sci.', 0)
(87543, 'Singh', 'Finance', 0)
(98345, 'Kim', 'Elec. Eng.', 0)
(98765, 'Bourikas', 'Elec. Eng.', 98)
(98988, 'Tanaka', 'Biology', 120)

**M2**: Now delete all the newly added "students" above (note: already existing students who happened to have tot\_cred = 0 should not get deleted)

In [22]:
# Fill in the python code that executes the SQL modification command
mycursor.execute("""
DELETE FROM Student 
WHERE Student.id IN (SELECT id FROM Instructor)
""")
mycursor.execute("""
SELECT * FROM Student
""")
myresult = mycursor.fetchall()
for x in myresult:
  print(x)

(128, 'Zhang', 'Comp. Sci.', 102)
(12345, 'Shankar', 'Comp. Sci.', 32)
(19991, 'Brandt', 'History', 80)
(23121, 'Chavez', 'Finance', 110)
(44553, 'Peltier', 'Physics', 56)
(45678, 'Levy', 'Physics', 46)
(54321, 'Williams', 'Comp. Sci.', 54)
(55739, 'Sanchez', 'Music', 38)
(70557, 'Snow', 'Physics', 0)
(76543, 'Brown', 'Comp. Sci.', 58)
(76653, 'Aoi', 'Elec. Eng.', 60)
(98765, 'Bourikas', 'Elec. Eng.', 98)
(98988, 'Tanaka', 'Biology', 120)

**M3**: Some of you may have noticed that the tot\_cred value for students did not match the credits from courses they have taken. Write and execute query to update tot\_cred based on the credits passed, to bring the database back to consistency.

In [23]:
# Fill in the python code that executes the SQL modification command
mycursor.execute("""
UPDATE
    Student S,
    (SELECT Takes.id,SUM(Class.credits) Credit
     FROM Class,Takes
     WHERE Class.class_id=Takes.class_id
     GROUP BY id) AS T
SET
    S.tot_cred = T.Credit   
WHERE
    S.id = T.id;
""")
mycursor.execute("""
SELECT * FROM Student
""")
myresult = mycursor.fetchall()
for x in myresult:
  print(x)

(128, 'Zhang', 'Comp. Sci.', 7)
(12345, 'Shankar', 'Comp. Sci.', 14)
(19991, 'Brandt', 'History', 3)
(23121, 'Chavez', 'Finance', 3)
(44553, 'Peltier', 'Physics', 4)
(45678, 'Levy', 'Physics', 11)
(54321, 'Williams', 'Comp. Sci.', 8)
(55739, 'Sanchez', 'Music', 3)
(70557, 'Snow', 'Physics', 0)
(76543, 'Brown', 'Comp. Sci.', 7)
(76653, 'Aoi', 'Elec. Eng.', 3)
(98765, 'Bourikas', 'Elec. Eng.', 7)
(98988, 'Tanaka', 'Biology', 8)

**M4**: Update the salary of each instructor to 200 times the number of course sections they have taught.

In [24]:
# Fill in the python code that executes the SQL modification command
mycursor.execute("""
UPDATE
    Instructor I,
     (SELECT Teaches.id,COUNT(Teaches.sec_id) sum FROM Teaches GROUP BY id) AS A4
SET
    I.salary=200*A4.sum
WHERE I.id=A4.id

""")
mycursor.execute("""
SELECT * FROM Instructor
""")
myresult = mycursor.fetchall()
for x in myresult:
  print(x)

(10101, 'Srinivasan', 'Comp. Sci.', Decimal('600.00'))
(12121, 'Wu', 'Finance', Decimal('200.00'))
(15151, 'Mozart', 'Music', Decimal('200.00'))
(22222, 'Einstein', 'Physics', Decimal('200.00'))
(32343, 'El Said', 'History', Decimal('200.00'))
(33456, 'Gold', 'Physics', Decimal('87000.00'))
(45565, 'Katz', 'Comp. Sci.', Decimal('400.00'))
(58583, 'Califieri', 'History', Decimal('62000.00'))
(76766, 'Crick', 'Biology', Decimal('400.00'))
(83821, 'Brandt', 'Comp. Sci.', Decimal('600.00'))
(87543, 'Singh', 'Finance', Decimal('80000.00'))
(98345, 'Kim', 'Elec. Eng.', Decimal('200.00'))

## What to Submit

Once you finish filling in all cells with your code, save this notebook and upload it to CCLE before the deadline.

Note : The final submission should run without errors. Click on 'Kernel -> Restart and Run All', this should not give any errors. 
Make sure the submission only contains the expected commands. Remove all unncessary prints!

In [25]:
mycursor.close()
mydb.close()